{
    "data": [
        {
            "title": "Naruto",
            "episodes": 220,
            "rating": "PG-13 - Teens 13 or older",
            "score": 8.01,
            "year": 2002,
            "synopsis": "Moments before Naruto Uzumaki\u0027s birth, a huge demon known as the Nine-Tailed Fox attacked Konohagakure, the Hidden Leaf Village, and wreaked havoc. In order to put an end to the demon\u0027s rampage, the leader of the village, the Fourth Hokage, sacrificed his life and sealed the monstrous beast inside the newborn Naruto.\n\nIn the present, Naruto is a hyperactive and knuckle-headed ninja growing up within Konohagakure. Shunned because of the demon inside him, Naruto struggles to find his place in the village. His one burning desire to become the Hokage and be acknowledged by the villagers who despise him. However, while his goal leads him to unbreakable bonds with lifelong friends, it also lands him in the crosshairs of many deadly foes.\n\n[Written by MAL Rewrite]"
        },
        {
            "title": "The Last: Naruto the Movie",
            "episodes": 1,
            "rating": "PG-13 - Teens 13 or older",
            "score": 7.79,
            "year": null,
            "synopsis": "Two years have passed since the end of the Fourth Great Ninja War. Konohagakure has remained in a state of peace and harmony—until Sixth Hokage Kakashi Hatake notices the moon is dangerously approaching the Earth, posing the threat of planetary ruin.\n\nAmidst the grave ordeal, Konoha is invaded by a new evil, Toneri Oosutuski, who suddenly abducts Hinata Hyuuga\u0027s little sister Hanabi. Kakashi dispatches a skilled ninja team comprised of Naruto Uzumaki, Sakura Haruno, Shikamaru Nara, Sai, and Hinata in an effort to rescue Hanabi from the diabolical clutches of Toneri. However, during their mission, the team faces several obstacles that challenge them, foiling their efforts.\n\nWith her abduction, the relationships the team share with one another are tested, and with the world reaching the brink of destruction, they must race against time to ensure the safety of their planet. Meanwhile, as the battle ensues, Naruto is driven to fight for something greater than he has ever imagined—love.\n\n[Written by MAL Rewrite]"
        },
        {
            "title": "Boruto: Naruto the Movie",
            "episodes": 1,
            "rating": "PG-13 - Teens 13 or older",
            "score": 7.38,
            "year": null,
            "synopsis": "The spirited Boruto Uzumaki, son of Seventh Hokage Naruto, is a skilled ninja who possesses the same brashness and passion his father once had. However, the constant absence of his father, who is busy with his Hokage duties, puts a damper on Boruto\u0027s fire. Upon learning that his father will watch the aspiring ninjas who will participate in the upcoming Chunin exams, Boruto is driven to prove to him that he is worthy of his attention. In order to do so, he enlists the help of Naruto\u0027s childhood friend and rival, Sasuke Uchiha. \n\nThe Chunin exams begin and progress smoothly, until suddenly, the Konohagakure is attacked by a new foe that threatens the long-standing peace of the village. Now facing real danger, Naruto and his comrades must work together to protect the future of their cherished home and defeat the evil that terrorizes their world. As this battle ensues, Boruto comes to realize the struggles his father once experienced—and what it truly means to be a ninja.\n\n[Written by MAL Rewrite]"
        },
        {
            "title": "Naruto: Shippuuden Movie 6 - Road to Ninja",
            "episodes": 1,
            "rating": "PG-13 - Teens 13 or older",
            "score": 7.68,
            "year": null,
            "synopsis": "Returning home to Konohagakure, the young ninja celebrate defeating a group of supposed Akatsuki members. Naruto Uzumaki and Sakura Haruno, however, feel differently. Naruto is jealous of his comrades\u0027 congratulatory families, wishing for the presence of his own parents. Sakura, on the other hand, is angry at her embarrassing parents, and wishes for no parents at all. The two clash over their opposing ideals, but are faced with a more pressing matter when the masked Madara Uchiha suddenly appears and transports them to an alternate world.\n\nIn this world, Sakura\u0027s parents are considered heroes—for they gave their lives to protect Konohagakure from the Nine-Tailed Fox attack 10 years ago. Consequently, Naruto\u0027s parents, Minato Namikaze and Kushina Uzumaki, are alive and well. Unable to return home or find the masked Madara, Naruto and Sakura stay in this new world and enjoy the changes they have always longed for. All seems well for the two ninja, until an unexpected threat emerges that pushes Naruto and Sakura to not only fight for the Konohagakure of the alternate world, but also to find a way back to their own.\n\n[Written by MAL Rewrite]"
        },
        {
            "title": "Naruto Movie 1: Dai Katsugeki!! Yuki Hime Ninpouchou Dattebayo!",
            "episodes": 1,
            "rating": "PG-13 - Teens 13 or older",
            "score": 7.12,
            "year": null,
            "synopsis": "Naruto Uzumaki and his squadmates, Sasuke Uchiha and Sakura Haruno, are sent on a mission to escort a movie crew on its way to film in the Land of Snow. They soon find out that they are accompanying a famous actress, Yukie Fujikaze, who persistently refuses to travel there, making the trip far more difficult than originally intended. After a surprising encounter with ninjas from the Land of Snow, Naruto discovers that there is more to Yukie than meets the eye.\n \nDai Katsugeki!! Yuki Hime Ninpouchou Dattebayo! follows the group as they attempt to overcome the obstacles in the Land of Snow and unveil Yukie\u0027s true purpose there as well.\n\n[Written by MAL Rewrite]"
        },
        {
            "title": "Naruto: Shippuuden Movie 1",
            "episodes": 1,
            "rating": "PG-13 - Teens 13 or older",
            "score": 7.29,
            "year": null,
            "synopsis": "A group of ninja is planning to revive a powerful demon, and once its spirit is reunited with its body, the world will be destroyed. The only way to prevent this from happening is for Shion, a shrine maiden, to seal it away for good.\n\nNaruto Uzumaki is tasked to guard her, but one thing stops Shion from accepting his help: she also has the ability to predict death—and she has foreseen his demise approaching soon. In order to escape his fate, Naruto must stay away from Shion; however, undeterred, he chooses to challenge the prophecy in order to protect Shion and the world.\n\n[Written by MAL Rewrite]"
        },
        {
            "title": "Naruto: Shippuuden Movie 2 - Kizuna",
            "episodes": 1,
            "rating": "PG-13 - Teens 13 or older",
            "score": 7.28,
            "year": null,
            "synopsis": "Unleashing a devastating surprise attack, flying ninjas from the Land of Sky are seeking revenge against their old enemy Konohagakure. Despite his eagerness to join the fight, Naruto Uzumaki is held up by Shinnou, a mysterious doctor who requires his assistance to save an injured person. While delivering the wounded man to the hospital, Naruto has an unexpected encounter with Amaru—a stormy youngster from a neighboring village desperately looking for Shinnou\u0027s help.\n\nMeanwhile, as the invaders withdraw to restore their forces, Tsunade seizes the opportunity to dispatch a small team including Sai, Shikamaru Nara, and Kakashi Hatake to strike down their base. Simultaneously, she commissions Naruto, Sakura Haruno, and Hinata Hyuuga to accompany Shinnou and Amaru on their journey. During this time, however, Orochimaru has his own schemes: he orders Sasuke Uchiha to bring him the doctor who specializes in the reincarnation technique.\n\nAs the escort group accidentally uncovers the sinister truth behind the attacks, tumultuous plans are set in motion. But even when confronted with an unforeseen reunion, Naruto does not waver in his endeavor to end the warfare and its disastrous effects.\n\n[Written by MAL Rewrite]"
        },
        {
            "title": "Naruto: Shippuuden Movie 4 - The Lost Tower",
            "episodes": 1,
            "rating": "PG-13 - Teens 13 or older",
            "score": 7.42,
            "year": null,
            "synopsis": "Led by Yamato, Naruto Uzumaki, Sakura Haruno, and Sai are assigned to capture Mukade, a rogue ninja who is pursuing the ancient chakra Ryuumyaku located underneath the Rouran ruins. While the Ryuumyaku has been sealed by the Fourth Hokage, the group fails to prevent Mukade from releasing its power. Consequently, a strong energy burst engulfs both Naruto and Yamato before they can escape.\n\nAs he awakens in a magnificent yet hostile kingdom, Naruto meets its young queen Saara and three Konohagakure ninjas on a top-secret mission. They reveal to him that he has time-traveled to Rouran 20 years into the past! To make matters worse, Mukade has already infiltrated the royal court, becoming the naive queen\u0027s most trusted minister under the alias Anrokuzan.\n\nJoining forces with the three ninjas, Naruto must protect Saara\u0027s life without fail to stop the villain\u0027s plans and return to the present.\n\n[Written by MAL Rewrite]"
        },
        {
            "title": "Naruto: Shippuuden Movie 5 - Blood Prison",
            "episodes": 1,
            "rating": "PG-13 - Teens 13 or older",
            "score": 7.46,
            "year": null,
            "synopsis": "During their discussion of a sensitive investigation A, the Fourth Raikage, and his subordinates are ambushed by a cloaked intruder. As the Kumogakure leader repels the assault, he is shocked to discover that the culprit is Naruto Uzumaki! \n\nHowever, the assassination attempt is not the only crime attributed to the young ninja, who vigorously denies the accusations. To avoid a diplomatic conflict, Tsunade forcibly sends him to Kusagakure\u0027s Houzuki Castle—a maximum-security penitentiary dedicated to ninja criminals—until the situation is resolved.\n\nDespite his powers being immediately suppressed by Mui, the prison\u0027s warden who possesses the ability to seal chakra, Naruto recklessly engages in futile escape attempts. But with the help of two fellow inmates, he realizes that there is more to this legendary detention facility than meets the eye. Uncovering a terrible secret, the trio embarks on a dangerous operation that may be Naruto\u0027s only chance to break free and prove his innocence.\n\n[Written by MAL Rewrite]"
        },
        {
            "title": "Naruto Movie 2: Dai Gekitotsu! Maboroshi no Chiteiiseki Dattebayo!",
            "episodes": 1,
            "rating": "PG-13 - Teens 13 or older",
            "score": 6.88,
            "year": null,
            "synopsis": "In a tumultuous effort, the Sunagakure ninjas attempt to repel an unforeseen invasion of mysterious armored warriors on the Land of Wind. Shortly afterwards, the same armored troops led by Temujin—a skilled knight of impressive power—ambush Naruto Uzumaki, Sakura Haruno, and Shikamaru Nara, who are on a mission to recover a lost ferret. Naruto and Temujin engage in a fierce fight that ends with both of them falling off a cliff.\n\nTaken aback by their friend\u0027s sudden misfortune, Sakura and Shikamaru witness yet another alarming development: a massive moving structure appears out of nowhere, ravaging any trees and rocks in its path. While Sakura sets off to find Naruto, Shikamaru infiltrates the imposing fortress in hopes of learning more about the critical situation. \n\nEntangled in a relentless conflict, the Konohagakure ninjas join forces with their Sunagakure counterparts to defeat the common enemy. However, amidst the turmoil, a clash between two different visions of an ideal world emerges.\n\n[Written by MAL Rewrite]"
        },
        {
            "title": "Naruto Movie 3: Dai Koufun! Mikazuki Jima no Animaru Panic Dattebayo!",
            "episodes": 1,
            "rating": "PG-13 - Teens 13 or older",
            "score": 6.92,
            "year": null,
            "synopsis": "Led by Kakashi Hatake, Naruto Uzumaki, Sakura Haruno, and Rock Lee are tasked to escort the extravagant Prince Michiru Tsuki and his spoiled son Hikaru to the prosperous Land of Moon when the two return from a long trip around the world. As if guarding two whimsical high-ranked individuals was not challenging enough, the prince\u0027s reckless decision to acquire an entire circus during their journey—mainly to entertain Hikaru\u0027s wish of owning the saber-toothed tiger featured in the show—further propels the mission into disarray.\n\nJust as things are finally settling down, the arrival of Michiru\u0027s convoy at the Land of Moon is met with an unforeseen crisis—the greedy Chief Minister Shabadaba has taken over the country with the assistance of mysterious, powerful ninjas. While Kakashi\u0027s team relentlessly fights the enemy by any means necessary, the two princes are forced to confront a new outlook on life through adversity.\n\n[Written by MAL Rewrite]"
        },
        {
            "title": "Boruto: Naruto the Movie - Naruto ga Hokage ni Natta Hi",
            "episodes": 1,
            "rating": "PG-13 - Teens 13 or older",
            "score": 7.32,
            "year": null,
            "synopsis": "Bundled with the limited edition of Blu-ray/DVD of Boruto: Naruto the Movie."
        },
        {
            "title": "Naruto Narutimate Hero 3: Tsuini Gekitotsu! Jounin vs. Genin!! Musabetsu Dairansen Taikai Kaisai!!",
            "episodes": 1,
            "rating": "PG-13 - Teens 13 or older",
            "score": 6.77,
            "year": null,
            "synopsis": "Konohagakure hosts a special tournament for ninjas of all ranks, stirring up fervor among the rookies who are eager to prove themselves in a competition against their superiors. Additionally, the winner is granted the opportunity to create their own village decree! Despite his enthusiasm to claim the prize, Naruto Uzumaki fails to focus on the game\u0027s objective as he becomes obsessed with confronting his teacher, Kakashi Hatake, in single combat.\n\n[Written by MAL Rewrite]"
        },
        {
            "title": "Naruto: Shippuuden - Sunny Side Battle",
            "episodes": 1,
            "rating": "PG-13 - Teens 13 or older",
            "score": 7.58,
            "year": null,
            "synopsis": "Back at their childhood home, siblings Itachi and Sasuke Uchiha experience an unusual morning together when Itachi becomes obsessed with cooking the perfect fried egg for Sasuke. Despite being completely focused on the task, he continuously fails to achieve the desired result. As Sasuke marvels at his brother\u0027s seemingly unnecessary behavior, he comes to realize that there is more than meets the eye to Itachi\u0027s efforts.\n\n[Written by MAL Rewrite]"
        },
        {
            "title": "Naruto: Shippuuden - Shippuu! \u0022Konoha Gakuen\u0022 Den",
            "episodes": 1,
            "rating": "PG-13 - Teens 13 or older",
            "score": 7.13,
            "year": null,
            "synopsis": "Naruto school special.\n\nNaruto is a new cool student and when he meets Sasuke they start fighting."
        },
        {
            "title": "Naruto Soyokazeden Movie: Naruto to Mashin to Mitsu no Onegai Dattebayo!!",
            "episodes": 1,
            "rating": "PG-13 - Teens 13 or older",
            "score": 6.95,
            "year": null,
            "synopsis": "While enjoying a barbecue alongside team members and peers, Naruto Uzumaki stumbles upon a strange old bottle that houses a genie! The mythical being is willing to grant three wishes, but in a flurry of excitement, Naruto ends up wasting the first two. Outraged, Sasuke Uchiha and Sakura Haruno start fighting with him over the last remaining chance.\n\nAs the other ninjas join the dispute, the whole matter—before they know it—turns into an all-out brawl for the precious container.\n\n[Written by MAL Rewrite]"
        },
        {
            "title": "Road of Naruto",
            "episodes": 1,
            "rating": "PG-13 - Teens 13 or older",
            "score": 8.4,
            "year": null,
            "synopsis": "In celebration of 20 years of Naruto, Studio Pierrot posted an anniversary PV on their YouTube channel. The PV is a compilation of newly reworked scenes from Naruto containing new animation."
        },
        {
            "title": "Boruto: Naruto Next Generations",
            "episodes": 293,
            "rating": "PG-13 - Teens 13 or older",
            "score": 5.99,
            "year": 2017,
            "synopsis": "Following the successful end of the Fourth Shinobi World War, Konohagakure has been enjoying a period of peace, prosperity, and extraordinary technological advancement. This is all due to the efforts of the Allied Shinobi Forces and the village\u0027s Seventh Hokage, Naruto Uzumaki. Now resembling a modern metropolis, Konohagakure has changed, particularly the life of a shinobi. Under the watchful eye of Naruto and his old comrades, a new generation of shinobi has stepped up to learn the ways of the ninja.\n\nBoruto Uzumaki is often the center of attention as the son of the Seventh Hokage. Despite having inherited Naruto\u0027s boisterous and stubborn demeanor, Boruto is considered a prodigy and is able to unleash his potential with the help of supportive friends and family. Unfortunately, this has only worsened his arrogance and his desire to surpass Naruto which, along with his father\u0027s busy lifestyle, has strained their relationship. However, a sinister force brewing within the village may threaten Boruto\u0027s carefree life.\n\nNew friends and familiar faces join Boruto as a new story begins.\n\n[Written by MAL Rewrite]"
        },
        {
            "title": "Kamiusagi Rope x Boruto: Naruto Next Generations",
            "episodes": 1,
            "rating": "G - All Ages",
            "score": 5.48,
            "year": null,
            "synopsis": "A 3-way collaboration between Kamiusagi Rope, Boruto: Naruto Next Generations, and TOHO Cinemas. The purpose is to promote a new TOHO theater opening up in Ueno on November 4, 2017. The collaboration video will also be available to view in TOHO Cinemas in Tokyo, Kanagawa, Chiba, and Saitama from Ocotober 21 - December 1."
        },
        {
            "title": "Naruto x UT",
            "episodes": 1,
            "rating": "PG-13 - Teens 13 or older",
            "score": 7.36,
            "year": null,
            "synopsis": "All-new animation offered throughout UNIQLO clothing stores in Japan on January 1, 2011. The DVD contains an exclusive version of Mayonaka Orchestra, by the Japanese rock band Aqua Timez. A limited number of the DVDs was offered as presents to people who bought UNIQLO\u0027s Naruto graphic T-shirts online or in their stores.\n\n(Source: ANN, edited)"
        },
        {
            "title": "Boruto: Naruto Next Generations Part 2",
            "episodes": null,
            "rating": "PG-13 - Teens 13 or older",
            "score": null,
            "year": null,
            "synopsis": null
        },
        {
            "title": "Naruto: Shippuuden",
            "episodes": 500,
            "rating": "PG-13 - Teens 13 or older",
            "score": 8.28,
            "year": 2007,
            "synopsis": "It has been two and a half years since Naruto Uzumaki left Konohagakure, the Hidden Leaf Village, for intense training following events which fueled his desire to be stronger. Now Akatsuki, the mysterious organization of elite rogue ninja, is closing in on their grand plan which may threaten the safety of the entire shinobi world.\n \nAlthough Naruto is older and sinister events loom on the horizon, he has changed little in personality—still rambunctious and childish—though he is now far more confident and possesses an even greater determination to protect his friends and home. Come whatever may, Naruto will carry on with the fight for what is important to him, even at the expense of his own body, in the continuation of the saga about the boy who wishes to become Hokage.\n\n[Written by MAL Rewrite]"
        },
        {
            "title": "Naruto: Shippuuden Movie 3 - Hi no Ishi wo Tsugu Mono",
            "episodes": 1,
            "rating": "PG-13 - Teens 13 or older",
            "score": 7.33,
            "year": null,
            "synopsis": "After being sent to investigate the alarming disappearance of four bloodline limit-wielding ninjas from different countries, Kakashi Hatake, Naruto Uzumaki, Sakura Haruno, and Sai successfully discover their whereabouts and inform the Hokage. Unexpectedly, Tsunade\u0027s further arrangements fall apart when Hiruko—the mastermind behind the incident and also a former Konohagakure ninja obsessed with power—appears to announce that he has absorbed the missing ninjas\u0027 unique abilities. On the verge of becoming invincible, he seeks one more bloodline limit before starting an all-out war to take over the world.\n\nAs Konohagakure\u0027s past connections with Hiruko raise suspicions among the nations about its involvement in the affair, Tsunade receives an ultimatum to solve the crisis. Left with no other choice, she decides to follow Kakashi\u0027s lead after he presents a daring yet salutary scheme—a proposal that could send him to certain death. However, Naruto opposes such a plan! Despite the Hokage\u0027s decision, he is determined to save his teacher\u0027s life, even if it means fighting friend and foe alike.\n\n[Written by MAL Rewrite]"
        },
        {
            "title": "Naruto SD: Rock Lee no Seishun Full-Power Ninden",
            "episodes": 51,
            "rating": "PG-13 - Teens 13 or older",
            "score": 7.17,
            "year": 2012,
            "synopsis": "The competitive shinobi world has proven to be challenging for Rock Lee, who lacks the typically required abilities. To compensate for this handicap, the young ninja tenaciously endures severe training to hone his hand-to-hand combat skills. Whenever necessary, he also resorts to creative fighting techniques. With the constant support of his teammates Neji Hyuuga and Tenten, Lee readily embraces daring adventures as opportunities to advance on his path toward excellence.\n\n[Written by MAL Rewrite]"
        },
        {
            "title": "Naruto: Takigakure no Shitou - Ore ga Eiyuu Dattebayo!",
            "episodes": 1,
            "rating": "PG-13 - Teens 13 or older",
            "score": 6.76,
            "year": null,
            "synopsis": "After safely escorting the cowardly Takigakure leader Shibuki to his homeland, Naruto Uzumaki, Sasuke Uchiha, and Sakura Haruno are taken aback by the village\u0027s sudden invasion of rogue ninjas. As their teacher Kakashi Hatake had departed for Konohagakure beforehand, the team is left to deal with the attacking forces on their own. \n\nWhile the group prepares for a rescue operation, they learn that Suien, the mastermind behind the assault, is pursuing the Hero Water—an elixir that briefly increases the chakra of those who drink it by tenfold. Knowing that the liquid is in Shibuki\u0027s possession, Suien takes the villagers hostage to use them as a bargaining chip. \n\nDespite the odds stacked against them, Naruto fights the enemy heroically, spurring Shibuki on to discover the courage to protect his people.\n\n[Written by MAL Rewrite]"
        }
    ]
}